#include <iostream>
using namespace std;
int main() {
	//dowhile1
	//int i = 1;
	//do {
		//cout << i << " ";
		//i += 2;
	//} while (i <= 100);

	//dowhile2
	//int a, b, i, sum = 0;
	//cin >> a >> b;
		//i = b;
		//do {
			//if (i % 2 != 0){
				//sum += 1;
		//}
		//i--;
		//} while (i >= a);
	//cout << sum << " ";
	
	//dowhile3
	//int n;
	//cin >> n;
	//int i = 1;
	//do {
		//cout << i * i;
		//i++;
	//} while (i * i <= n);
	
	//29. с помощью оператора while напишите программу 
	//вывода всех четных чисел в диапазоне от 2 до 100 включительно.
	
	//int i = 2;
	//do {
		//if (i % 2 == 0) {

			//cout << i << " ";
		//}
		//i++;
		//}while (i <= 100);
		
		//30. С помощью оператора while напишите программу определения 
			//суммы всех нечетных чисел в диапазоне от 1 до 99 включительно.

	//int i = 1;
	//do {
		//if (i % 2 != 0) {
			//cout << i << " ";
		//}
		//i++;
	//} while (i <= 99);


	//17. В ЭВМ вводятся по очереди данные о росте N учащихся класса.
		//Определить средний рост учащихся класса.

	//int n;
	//int i = 1;
	//cin >> n;
	//int k;
	//int l = 0;
	//do {
		//cin >> k;
		//l = l + k;
		//i++;
	//} while (i <= n);
	//l = l / 5;
	//cout << n;
	




































}